#### pd.DataFrame({列名:对应的信息})  引用已经准备好的数据，创建DataFrame的表

In [1]:
import pandas as pd
name = pd.Series(["小陈","小李","小王","小张","小赵","小周"],index=["001","002","003","004","005","006"])
gender = pd.Series(["女","女","男","男","女","男"],index=["006","005","004","003","002","001"])
height = pd.Series(["172.5","168.0","178.2","181.3","161.7"],index=["001","002","003","004","005",])

df1 = pd.DataFrame({"姓名":name,"性别":gender,"身高":height})

#### 变量名.fillna(数字) 将表中未知数据替换为括号中的内容

In [2]:
fillna_df1 = df1.fillna(0)
fillna_df1

     姓名 性别     身高
001  小陈  男  172.5
002  小李  女  168.0
003  小王  男  178.2
004  小张  男  181.3
005  小赵  女  161.7
006  小周  女      0

#### 变量名.index 提取表中所有索引（第一列）

In [3]:
df1.index

Index(['001', '002', '003', '004', '005', '006'], dtype='object')

#### 变量名.columns 提取表中所有列名（第一行）

In [4]:
df1.columns

Index(['姓名', '性别', '身高'], dtype='object')

#### 变量名.T 对原表进行转制（行列交换）

In [5]:
df1.T

      001    002    003    004    005  006
姓名     小陈     小李     小王     小张     小赵   小周
性别      男      女      男      男      女    女
身高  172.5  168.0  178.2  181.3  161.7  NaN

#### 两种方式打印该表的某一列 ① 变量名.列名  ② 变量名["列名"] 第二种方式可以顾及到字符串中的空格等符号

In [6]:
print(df1.姓名)
print(df1["身高"].fillna(0))

001    小陈
002    小李
003    小王
004    小张
005    小赵
006    小周
Name: 姓名, dtype: object
001    172.5
002    168.0
003    178.2
004    181.3
005    161.7
006        0
Name: 身高, dtype: object

#### 变量名[["列1","列2","列3",...]]  提取该表的指定多列

In [7]:
df1[["身高","性别"]].fillna(0)

        身高 性别
001  172.5  男
002  168.0  女
003  178.2  男
004  181.3  男
005  161.7  女
006      0  女

In [8]:
# 变量名.loc["索引名"]  提取指定对应索引的所有内容 (索引名带双引号)
print(df1.loc["005"])
# 变量名.loc[["索引名"]]  提取指定多条对应索引的所有内容(用两个方括号“[[]]”)
# 变量名.loc["索引起始":"索引结束"]  提取从指定的起始到结束的一段内容
print(df1.loc[["005","002","004"]])
# 变量名.loc[[索引1,索引2...],[列1,列2...]]  提取指定的多条索引的指定多个条件；如果将[索引1,索引2...]整体替换为冒号“:”意味所有索引
print(df1.loc[["005","001"],["姓名","身高"]])
print(df1)

姓名       小赵
性别        女
身高    161.7
Name: 005, dtype: object
     姓名 性别     身高
005  小赵  女  161.7
002  小李  女  168.0
004  小张  男  181.3
     姓名     身高
005  小赵  161.7
001  小陈  172.5
     姓名 性别     身高
001  小陈  男  172.5
002  小李  女  168.0
003  小王  男  178.2
004  小张  男  181.3
005  小赵  女  161.7
006  小周  女    NaN

#### 变量名.head(行数) 提取所输入行数的数据(不输入默认为5)

In [9]:
df1.head(2)

     姓名 性别     身高
001  小陈  男  172.5
002  小李  女  168.0

In [10]:
# 检查列数据类型
print(df1["身高"].dtype)
# 如果数据类型不是数值型，尝试转换
if df1["身高"].dtype.kind not in 'fi':
    # 尝试将身高列转换为浮点数，忽略转换失败的条目
    df1["身高"] = pd.to_numeric(df1["身高"], errors='coerce')

object

#### 变量名[(变量名["列名1"] > 数据 ) & (变量名["列名2"] == "数据")]   用于筛选指定条件的数据

In [11]:
select_df1 = df1[(df1["身高"] > 165) & (df1["性别"] == "女")] # 筛选df1表中身高大于165和性别为女的所有数据
select_df1

     姓名 性别     身高
002  小李  女  168.0

#### 创建一个6个人的表，包括姓名、性别、身高、语文

In [12]:
name = pd.Series(["张三","李四","王五","赵七","李八","周久"],index=["001","002","003","004","005","006"])
gender = pd.Series(["女","女","男","男","女","男"],index=["006","005","004","003","002","001"])
height = pd.Series(["172.5","168.0","178.2","181.3","161.7","165.4"],index=["001","002","003","004","005","006"])
chinease = pd.Series(["89","79","65","75","83","74"],index=["002","004","006","001","003","005"])

df_t = pd.DataFrame({"姓名":name,"性别":gender,"身高":height,"语文":chinease})
df_t

     姓名 性别     身高  语文
001  张三  男  172.5  75
002  李四  女  168.0  89
003  王五  男  178.2  83
004  赵七  男  181.3  79
005  李八  女  161.7  74
006  周久  女  165.4  65

#### 变量名["列名"] = ["与列","一一","对照,"的数量",“的数据”]    如下，当输入列名不存在时，会新加入该列

In [13]:
df_t["删我"] = ["哈","删","了","我","吧","行"]
df_t["英语"] = ["86","87","83","75","73","96"]
df_t["班级"] = ["一班","三班","二班","二班","一班","三班"]
df_t

     姓名 性别     身高  语文 删我  英语  班级
001  张三  男  172.5  75  哈  86  一班
002  李四  女  168.0  89  删  87  三班
003  王五  男  178.2  83  了  83  二班
004  赵七  男  181.3  79  我  75  二班
005  李八  女  161.7  74  吧  73  一班
006  周久  女  165.4  65  行  96  三班

#### 变量名["索引名"] = ["与列","一一","对照,"的数量",“的数据”]

In [14]:
df_t.loc["007"] = ["小何","男","174.8","88","的","79","二班"]
df_t.loc["008"] = ["陈雨","女","159.5","89","好","86","二班"]

df_t

     姓名 性别     身高  语文 删我  英语  班级
001  张三  男  172.5  75  哈  86  一班
002  李四  女  168.0  89  删  87  三班
003  王五  男  178.2  83  了  83  二班
004  赵七  男  181.3  79  我  75  二班
005  李八  女  161.7  74  吧  73  一班
006  周久  女  165.4  65  行  96  三班
007  小何  男  174.8  88  的  79  二班
008  陈雨  女  159.5  89  好  86  二班

#### 变量名.drop("索引名",axis=1)  删除该列的位置    将括号中内容改为("索引1","索引6")，则表示删除从1到6的一个范围;axis=0则删行

In [15]:
dft_drop_c = df_t.drop("008",axis=0)
dft_drop_a = dft_drop_c.drop("删我",axis=1)
dft_drop_a

     姓名 性别     身高  语文  英语  班级
001  张三  男  172.5  75  86  一班
002  李四  女  168.0  89  87  三班
003  王五  男  178.2  83  83  二班
004  赵七  男  181.3  79  75  二班
005  李八  女  161.7  74  73  一班
006  周久  女  165.4  65  96  三班
007  小何  男  174.8  88  79  二班

#### 变量1.sub(变量2,fill_value=0) 此处sub表示表1减表2，可以换为div和mul  此处的加减法也符合广播原则

In [16]:
dft_drop_a["语文"] = pd.to_numeric(dft_drop_a["语文"], errors='coerce')
dft_drop_a["语文"] = dft_drop_a["语文"] + 2  
dft_drop_a

     姓名 性别     身高  语文  英语  班级
001  张三  男  172.5  77  86  一班
002  李四  女  168.0  91  87  三班
003  王五  男  178.2  85  83  二班
004  赵七  男  181.3  81  75  二班
005  李八  女  161.7  76  73  一班
006  周久  女  165.4  67  96  三班
007  小何  男  174.8  90  79  二班

#### pd.to_numeric(变量名["列名"], errors='coerce')   将指定列的数据转化为浮点数

In [17]:
dft_drop_a["英语"] = pd.to_numeric(dft_drop_a["英语"], errors='coerce')
# 创建一个Series序列
bonus = pd.Series({"语文":1,"英语":1})
# 将DataFrame与Series相加  
dft_drop_a[["语文","英语"]] = dft_drop_a[["语文","英语"]] + bonus   
dft_drop_a

     姓名 性别     身高  语文  英语  班级
001  张三  男  172.5  78  87  一班
002  李四  女  168.0  92  88  三班
003  王五  男  178.2  86  84  二班
004  赵七  男  181.3  82  76  二班
005  李八  女  161.7  77  74  一班
006  周久  女  165.4  68  97  三班
007  小何  男  174.8  91  80  二班

#### 使用pd.DataFrame(键:{值},键:{值},....）字典方式，创建一个students_list列表 ， 使用.T交换索引和列名

In [18]:
import numpy as np
students_list = pd.DataFrame({
    "001":{"姓名":"小何","语文":89,"数学":82,"英语":92},
    "002":{"姓名":"小张","语文":79,"数学":86,"英语":84},
    "003":{"姓名":"小李","语文":83,"数学":91,"英语":78},
    "004":{"姓名":"小陈","语文":89,"数学":84,"英语":90},
    "005":{"姓名":"小王","语文":82,"数学":91,"英语":83}
}).T

#### 求"语文"到"英语"的所有列，的所有行（":"），的平均值".mean()" ，此处axis=1则表示计算整行的平均值，如不输入或axis=0则计算列

In [19]:
average = students_list.loc[:,"语文":"英语"].mean(axis=1)
name = students_list["姓名"]
students_average = pd.DataFrame({"姓名":name,"平均分":average})
students_average

     姓名        平均分
001  小何  87.666667
002  小张       83.0
003  小李       84.0
004  小陈  87.666667
005  小王  85.333333

#### 基于上表，利用.iterrows()遍历列表每一行，定义变量index和row,具体表达如下

In [20]:
for index,row in students_average.iterrows():
    print(f"{row["姓名"]}同学的平均分是{row["平均分"]}")

小何同学的平均分是87.66666666666667
小张同学的平均分是83.0
小李同学的平均分是84.0
小陈同学的平均分是87.66666666666667
小王同学的平均分是85.33333333333333

#### 运用apply()调用函数，使用lambda 变量名 : 具体操作 定义一个临时使用的函数； 此处用来计算各科第二高的分数

In [21]:
students_list.loc[:,"语文":"英语"].apply(lambda average_of_exam : np.sort(average_of_exam)[-2] )

语文    89
数学    91
英语    90
dtype: int64

#### 运用.astype(数据类型)将指定的表中数据转换，然后通过.describe()来获取对应列名的相关数据，最后用.round(保留小数位数)来进行保留指定位数的四舍五入

In [24]:
students_list.loc[:,"语文":"英语"].astype(int).describe().round(2)

          语文     数学     英语
count   5.00   5.00   5.00
mean   84.40  86.80  85.40
std     4.45   4.09   5.64
min    79.00  82.00  78.00
25%    82.00  84.00  83.00
50%    83.00  86.00  84.00
75%    89.00  91.00  90.00
max    89.00  91.00  92.00

#### Series创建只有一列的表，DataFrame创建带多列的表，index提取所有索引（第一列），columns提取所有列名（第一行）
#### fillna(指定数)将空值替换为指定数，astype(数据类型)将指定表转换为指定数据类型，round(保留小数位数)对输出数据的小数位数做指定的四舍五入
#### loc[索引名]，iloc[索引数] 提取指定的索引内容 ，head(行数) 提取列表中指定行数的数据，describe() 提取对应列的一些统计数据
#### 变量名.loc[索引名] = [与列表对应数量的数据] 创建一个指定索引名和指定数据内容的新行
#### drop(索引名,axis=1)删除指定索引名下一行的内容（若为列名，axis=0则为一列）
#### 变量名.loc[索引名,列名] = "内容" 为列表中指定单元格增加内容